#define MAPPING					//不包含头文件mapping.h

/******************************************
头文件声明
******************************************/
#include "public.h"
#include "pe.h"
#include "task.h"

/******************************************
映射变量的定义
******************************************/
int mapping[NTASK];		//映射序列，范围0-2
unsigned long mapn[RUNTIME];	//映射次数

/*******************************************************
1.位置：映射函数
2.功能：将map指向的映射序列，复制到p指向的数组中
3.输入：源映射序列的数组，目的映射序列的数组
4.返回值：无
*******************************************************/
void Copy_map(int *p,int *map)
{
    for(int i = 0; i < NTASK; i++)
    {
        p[i] = map[i];
    }
}

/************************************************
1.功能打印映射
************************************************/
void Print_mapping(int *p)
{
	printf("mapping:");
	for(int i = 0; i < NTASK; i++)
	{
		printf("%d ",p[i]);
	}
	printf("\n");
}

/************************************************
1.功能初始化映射，将所有的任务都映射的处理器p0上
************************************************/
void Init_mapping(int *map)
{
	for(int i = 0; i < NTASK; i++)
	{
		map[i] = 0;
	}
}